# Brewfile generated from dotfiles inspection
# - Formulae: command-line tools and utilities referenced in the repo
# - Casks: GUI/terminal apps referenced by the dotfiles

# Core CLI tools
brew "git"
brew "zsh"
brew "vim"
brew "tmux"
brew "stow"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "zoxide"
brew "eza"
brew "jq"

# System / monitoring
brew "btop"
brew "bottom"
brew "cava"

# Tiling/window manager & helpers (yabai/skhd/sketchybar appear in configs)
# TODO set porper taps for these
# brew "yabai"
# brew "skhd"
# brew "sketchybar"

# Developer tooling
brew "hyperfine"
brew "git-delta"
brew "rustup"

# GUI terminals (optional; the bootstrap script asks interactively)
cask "alacritty"
cask "kitty"

# Notes:
# - The bootstrap scripts in this repo also offer optional Rust cargo installs
#   (git-delta, ripgrep, fd-find, zoxide, bottom, eza, hyperfine). Installing
#   `rust` above allows you to run `cargo install` as the bootstrap suggests.
# - Some formulae (yabai, sketchybar) historically require enabling permissions
#   or additional taps on macOS; the Brewfile lists the common formula names.
#   If any formula name differs for your Homebrew setup, adjust accordingly.

